# HasCustomAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..HasCustomAxis Property
IFCExtrusionCreationData Class See Also
---
Identifies if the data contains a custom extrusion axis.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasCustomAxis { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasCustomAxis As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasCustomAxis {
	bool get ();
}
```

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace